# Rpstr_GetValueReal

## Description
Get a real value from the VectorScript value repository.

```pascal
FUNCTION Rpstr_GetValueReal(
				name         : STRING;
				defaultValue : REAL): REAL;
```

```python
def vs.Rpstr_GetValueReal(name, defaultValue):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|defaultValue|REAL|Default value if the name does not exist in the VectorScript value repository.|

## Remarks
Here is a sample for when this is  used from the SDK plugin to communicate with a dialog:
```cpp
bool CDlgXXX::CreateDialogLayout()
{
	VectorWorks::Scripting::IVectorScriptEnginePtr	vsEngine( VectorWorks::Scripting::IID_VectorScriptEngine );
	if ( vsEngine )
	{
		VWVariant	varParamsList( true );
		vsEngine->Repository_SetValue( "XXX_VarName", varParamsList );
	}

	return this->CreateDialogLayoutFromRsrcAndVWR( kDialogID, DefaultPluginVWRIdentifier() );
}
```

## Examples
```pascal
resultVal := Rpstr_GetValueReal('Example', 1.0);
```
```python
import vs

# Get a real value from the VectorScript value repository.
name = 'Example'
defaultValue = 1.0

value = vs.Rpstr_GetValueReal(name, defaultValue)
vs.Message('Rpstr_GetValueReal returned: ' + str(value))
```

## See Also
VS Functions:
Rpstr_RemoveValues
| Rpstr_RemoveValue
| Rpstr_GetValueBool
| Rpstr_SetValueBool
| Rpstr_GetValueInt
| Rpstr_SetValueInt
| Rpstr_GetValueReal
| Rpstr_SetValueReal
| Rpstr_GetValueStr
| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012

## Category
* Utility